In [1]:
import pandas as pd
import numpy as np

## Definitions

In [2]:
# read, and create an identifier for each course  
def set_course_name(file_path, course_name):
    course_data = pd.read_csv(file_path, header='infer')
    course_data["Course Name"] = course_name
    print(course_data.tail(2))
    return course_data

In [3]:
def merging_df(dataframes_list):
    merged_df = pd.concat(dataframes_list)
    print(merged_df.shape)
    print(merged_df.tail(10))
    return merged_df

## Import information

In [4]:
math_course_data = set_course_name("./_data/math_course_data.csv", "Math")

  Student Name   Student Contact  Grade Course Name
2         Mark    mark@gmail.com     90        Math
3        Shane   shane@gmail.com     87        Math

In [5]:
chem_course_data = set_course_name("./_data/chemistry_course_data.csv", "Chemistry")

  Student Name   Student Contact  Grade Course Name
2         Mark    mark@gmail.com     58   Chemistry
3        Shane   shane@gmail.com     74   Chemistry

In [6]:
biology_course_data = set_course_name("./_data/biology_course_data.csv", "Biology")

  Student Name   Student Contact  Grade Course Name
2         Mark    mark@gmail.com     90     Biology
3        Shane   shane@gmail.com     95     Biology

In [7]:
output = {}
output['Math Columns'] = math_course_data.columns.values.tolist()
output['Chemistry Columns'] = chem_course_data.columns.values.tolist()
output['Biology Columns'] = biology_course_data.columns.values.tolist()
pd.set_option('display.max_colwidth', -1)
pd.DataFrame(data=output)

      Math Columns Chemistry Columns  Biology Columns
0  Student Name     Student Name      Student Name
1  Student Contact  Student Contact   Student Contact
2  Grade            Grade             Grade
3  Course Name      Course Name       Course Name

In [8]:
output = {}
output['Math Columns Type'] = math_course_data.dtypes
output['Chemistry Columns Type'] = chem_course_data.dtypes
output['Biology Columns Type'] = biology_course_data.dtypes
pd.set_option('display.max_colwidth', -1)
pd.DataFrame(data=output)

                Math Columns Type Chemistry Columns Type Biology Columns Type
Student Name     object            object                 object
Student Contact  object            object                 object
Grade            int64             int64                  int64
Course Name      object            object                 object

In [9]:
math_course_data.head(2)

  Student Name     Student Contact  Grade Course Name
0  Al            al@gmail.com       50     Math
1  Dominic       dominic@gmail.com  75     Math

In [10]:
chem_course_data.head(3)

  Student Name     Student Contact  Grade Course Name
0  Al            al@gmail.com       80     Chemistry
1  Dominic       dominic@gmail.com  56     Chemistry
2  Mark          mark@gmail.com     58     Chemistry

In [11]:
biology_course_data.head(3)

  Student Name     Student Contact  Grade Course Name
0  Al            al@gmail.com       90     Biology
1  Dominic       dominic@gmail.com  90     Biology
2  Mark          mark@gmail.com     90     Biology

In [12]:
math_course_data.shape

(4, 4)

In [13]:
chem_course_data.shape

(4, 4)

In [14]:
biology_course_data.shape

(4, 4)

## Merge Data

In [15]:
courses = [math_course_data, chem_course_data, biology_course_data]

In [16]:
merged_info = merging_df(courses)

(12, 4)
  Student Name     Student Contact  Grade Course Name
2  Mark          mark@gmail.com     90     Math
3  Shane         shane@gmail.com    87     Math
0  Al            al@gmail.com       80     Chemistry
1  Dominic       dominic@gmail.com  56     Chemistry
2  Mark          mark@gmail.com     58     Chemistry
3  Shane         shane@gmail.com    74     Chemistry
0  Al            al@gmail.com       90     Biology
1  Dominic       dominic@gmail.com  90     Biology
2  Mark          mark@gmail.com     90     Biology
3  Shane         shane@gmail.com    95     Biology

## Cleaning up

### How to unneeded drop columns

In [17]:
# merged_info.drop(columns=['columns_name'],  axis=1, inplace=True)
# merged_info.shape

In [18]:
# merged_info.head(2)

### Remove null rows

In [19]:
merged_info.dropna(inplace=True)

In [20]:
merged_info.shape

(12, 4)

In [21]:
merged_info.head(3)

  Student Name     Student Contact  Grade Course Name
0  Al            al@gmail.com       50     Math
1  Dominic       dominic@gmail.com  75     Math
2  Mark          mark@gmail.com     90     Math

### Fill NaN values with 0

In [22]:
merged_info = merged_info.fillna(0)

In [23]:
merged_info.shape

(12, 4)

In [24]:
merged_info.head(3)

  Student Name     Student Contact  Grade Course Name
0  Al            al@gmail.com       50     Math
1  Dominic       dominic@gmail.com  75     Math
2  Mark          mark@gmail.com     90     Math

## Validations before any math

### _By Student Contact_

In [25]:
merged_info.shape

(12, 4)

In [26]:
merged_info.drop_duplicates(subset="Student Contact")
merged_info.shape

(12, 4)

### _By Student Name_

In [27]:
student_name_contact_validation = merged_info.groupby(["Student Contact"])["Student Name "].value_counts().unstack(fill_value=0)

In [28]:
student_name_contact_validation.head(10)

Student Name       Al  Dominic  Mark   Shane
Student Contact
al@gmail.com       3   0        0      0
dominic@gmail.com  0   3        0      0
mark@gmail.com     0   0        3      0
shane@gmail.com    0   0        0      3

In [29]:
student_name_contact_validation.columns

Index(['Al', 'Dominic', 'Mark ', 'Shane '], dtype='object', name='Student Name ')

## Calculations

In [30]:
merged_info.head(10)

  Student Name     Student Contact  Grade Course Name
0  Al            al@gmail.com       50     Math
1  Dominic       dominic@gmail.com  75     Math
2  Mark          mark@gmail.com     90     Math
3  Shane         shane@gmail.com    87     Math
0  Al            al@gmail.com       80     Chemistry
1  Dominic       dominic@gmail.com  56     Chemistry
2  Mark          mark@gmail.com     58     Chemistry
3  Shane         shane@gmail.com    74     Chemistry
0  Al            al@gmail.com       90     Biology
1  Dominic       dominic@gmail.com  90     Biology

In [31]:
merged_info_greater_th = merged_info.loc[merged_info['Grade'] >= 80]
merged_info_greater_th.shape

(7, 4)

In [32]:
merged_info_greater_th.head(3)

  Student Name   Student Contact  Grade Course Name
2  Mark          mark@gmail.com   90     Math
3  Shane         shane@gmail.com  87     Math
0  Al            al@gmail.com     80     Chemistry

In [33]:
merged_info_less_th = merged_info.loc[merged_info['Grade'] < 80]
merged_info_less_th.shape

(5, 4)

In [34]:
merged_info_less_th.head(3)

  Student Name     Student Contact  Grade Course Name
0  Al            al@gmail.com       50     Math
1  Dominic       dominic@gmail.com  75     Math
1  Dominic       dominic@gmail.com  56     Chemistry

In [35]:
# Shapes
output = {}
output['Description'] = 'Shapes'
output['Merged Data'] = str(merged_info.shape)
output['Merged + Greater Thr Results'] = str(merged_info_greater_th.shape)
output['Merged + Less Thr Results'] = str(merged_info_less_th.shape)
pd.set_option('display.max_colwidth', -1) 
pd.DataFrame(data=output, index=['']).T

Description                   Shapes
Merged Data                   (12, 4)
Merged + Greater Thr Results  (7, 4)
Merged + Less Thr Results     (5, 4)

In [36]:
# Percentage 
output = {}
output['Description'] = 'Percentage'
output['Merged Data'] = str(merged_info.shape[0]/merged_info.shape[0]*100)
output['Merged + Greater Thr Results'] = str(merged_info_greater_th.shape[0]/merged_info.shape[0]*100)
output['Merged + Less Thr Results'] = str(merged_info_less_th.shape[0]/merged_info.shape[0]*100)
pd.set_option('display.max_colwidth', -1) 
pd.DataFrame(data=output, index=['']).T

Description                   Percentage
Merged Data                   100.0
Merged + Greater Thr Results  58.333333333333336
Merged + Less Thr Results     41.66666666666667

## END